Some examples with pandas library.

In [18]:
#import utils
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib
import matplotlib.pyplot as plt
from statsmodels.graphics.mosaicplot import mosaic

%matplotlib inline
pd.options.display.max_rows = 1000
pd.options.display.max_columns = 100

In [2]:
# create a DataFrame 
df = pd.DataFrame([[100, 1990, 100000],
                  [120, 2002, 150000],
                  [90, 2012, 120000]],
                 index = [5, 10,15],
                 columns = ["area","built","price"])

In [3]:
df

    area  built   price
5    100   1990  100000
10   120   2002  150000
15    90   2012  120000

In [4]:
# loc: label-based indexing
# iloc: position-based indexing

In [5]:
# select a single value in a DataFrame using loc
df.loc[5,"area"]

100

In [6]:
# select a single value in a DataFrame using iloc
df.iloc[0,0]

100

In [7]:
# select column(s) in a DataFrame - I
df.loc[:,"area"]

5     100
10    120
15     90
Name: area, dtype: int64

In [8]:
# iloc version
df.iloc[:,0]

5     100
10    120
15     90
Name: area, dtype: int64

In [9]:
# select column(s) in a DataFrame - II
df["area"]

5     100
10    120
15     90
Name: area, dtype: int64

In [10]:
# select column(s) in a DataFrame - III
df.area

5     100
10    120
15     90
Name: area, dtype: int64

In [11]:
df.loc[5:10,"area"]

5     100
10    120
Name: area, dtype: int64

In [12]:
# print a row of a DataFrame using loc
df.loc[10]

area        120
built      2002
price    150000
Name: 10, dtype: int64

In [13]:
# Returned object is a Series object
type(df.iloc[:,0])

pandas.core.series.Series

In [14]:
# Select a specific region
df.iloc[[1,2], [1,2]]

    built   price
10   2002  150000
15   2012  120000

In [15]:
df.iloc[[0,2], [1,2]]

    built   price
5    1990  100000
15   2012  120000

In [21]:
master = Tk()
Label(master, text="First Name").grid(row=0)
Label(master, text="Last Name").grid(row=1)

e1 = Entry(master)
e2 = Entry(master)

e1.grid(row=0, column=1)
e2.grid(row=1, column=1)

mainloop()